back-end/app/controllers/api/documents_controller.rb

SELECT "documents".* FROM "documents" WHERE (created_by_id = 10 OR id IN (NULL))
---
  def index
    # Fetch documents where the current user is either the creator or has permissions
    @documents = Document.where("created_by_id = ? OR id IN (?)", current_user.id, permissioned_document_ids)

SELECT "documents".* FROM "documents" WHERE (created_by_id = 10 OR id IN (NULL)) ORDER BY "documents"."updated_at" DESC LIMIT $1  [["LIMIT", 5]]
---
  def recent
      # Fetch recent documents opened by the current user
      @recent_documents = Document.where("created_by_id = ? OR id IN (?)", current_user.id, permissioned_document_ids).order(updated_at: :desc).limit(5)

SELECT COUNT(*) FROM "documents" WHERE "documents"."created_by_id" = $1  [["created_by_id", 10]]
SELECT COUNT(*) FROM "documents" INNER JOIN "permissions" ON "permissions"."document_id" = "documents"."id" WHERE "permissions"."user_id" = $1  [["user_id", 10]]
---
  def user_activity
    # Count documents created by the current user
    created_count = Document.where(created_by_id: current_user.id).count

    # Count documents shared with the current user (where they have permission)
    shared_count = Document.joins(:permissions)
                           .where(permissions: { user_id: current_user.id })
                           .count

INSERT INTO "documents" ("title", "content", "created_by_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    @document = Document.new(document_params)
    @document.created_by_id = current_user.id # Set the creator to the current user

    if @document.save

SELECT 1 AS one FROM "permissions" WHERE "permissions"."document_id" = $1 AND "permissions"."user_id" = $2 AND "permissions"."access_type" = $3 LIMIT $4  [["document_id", 59], ["user_id", 10], ["access_type", 2], ["LIMIT", 1]]
UPDATE "documents" SET "content" = $1, "updated_at" = $2 WHERE "documents"."id" = $3
---
  def update
    # Check if the current user is the creator of the document or has the editor role
    if current_user.id == @document.created_by_id || @document.permissions.exists?(user_id: current_user.id, access_type: :editor)
      if @document.update(document_params)

DELETE FROM "documents" WHERE "documents"."id" = $1  [["id", 57]]
---
  def destroy
    if current_user.id == @document.created_by_id
      @document.destroy

SELECT "permissions"."document_id" FROM "permissions" WHERE "permissions"."user_id" = $1 AND "permissions"."access_type" IN ($2, $3)  [["user_id", 10], ["access_type", 1], ["access_type", 2]]
---
  def permissioned_document_ids
    # Get the IDs of documents for which the user has access permissions
    # You can filter by access type if needed, e.g., for editors only:
    Permission.where(user: current_user.id, access_type: [:viewer, :editor]).pluck(:document_id)