back-end/app/controllers/api/document_versions_controller.rb

  def index
    # Filter versions by the specific document
    @document_versions = DocumentVersion.where(document_id: params[:document_id])
---
SELECT "document_versions".* FROM "document_versions" WHERE "document_versions"."document_id" = $1  [["document_id", 59]]

  def create
    document = Document.find(document_version_params[:document_id])

    # Check if the current user is the creator of the document or has the editor role
    if current_user.id == document.created_by_id || document.permissions.exists?(user_id: current_user.id, access_type: :editor)
      @document_version = DocumentVersion.new(document_version_params)
      @document_version.created_by_id = current_user.id # Set the creator to the current user

      if @document_version.save
---
SELECT "documents".* FROM "documents" WHERE "documents"."id" = $1 LIMIT $2  [["id", 59], ["LIMIT", 1]]
INSERT INTO "document_versions" ("document_id", "content", "version_number", "created_by_id", "change_description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
SELECT 1 AS one FROM "permissions" WHERE "permissions"."document_id" = $1 AND "permissions"."user_id" = $2 AND "permissions"."access_type" = $3 LIMIT $4  [["document_id", 59], ["user_id", 10], ["access_type", 2], ["LIMIT", 1]]