back-end/app/controllers/api/documents_controller.rb

  def permissioned_document_ids
    # Get the IDs of documents for which the user has access permissions
    # You can filter by access type if needed, e.g., for editors only:
    Permission.where(user: current_user.id, access_type: [:viewer, :editor]).pluck(:document_id)
---
SELECT "permissions"."document_id" FROM "permissions" WHERE "permissions"."user_id" = $1 AND "permissions"."access_type" IN ($2, $3)  [["user_id", 4], ["access_type", 1], ["access_type", 2]]