back-end/app/controllers/application_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
---
    def authenticate_request
        token = request.headers['Authorization']&.split(' ')&.last
        decoded_token = decode_jwt(token)

        if decoded_token
        @current_user = User.find_by(id: decoded_token[:user_id])