back-end/app/controllers/permissions_controller.rb

INSERT INTO "permissions" ("user_id", "document_id", "access_type", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 10], ["document_id", 59], ["access_type", 2], ["created_at", "2024-10-17 21:20:13.750433"], ["updated_at", "2024-10-17 21:20:13.750433"]]
---
    def create

        permission = Permission.new(access_type: permission_params[:access_type], user_id: permission_params[:user], document_id: permission_params[:document])

        if permission.save

SELECT "permissions".* FROM "permissions" WHERE "permissions"."document_id" = $1  [["document_id", 59]]
SELECT 1 AS one FROM "permissions" WHERE "permissions"."document_id" = $1 LIMIT $2  [["document_id", 59], ["LIMIT", 1]]
---
    def show
        permissions = Permission.where(document_id: params[:id])
        if permissions.any?

SELECT "permissions".* FROM "permissions" WHERE "permissions"."id" = $1 LIMIT $2  [["id", 63], ["LIMIT", 1]]
SELECT "documents".* FROM "documents" WHERE "documents"."id" = $1 LIMIT $2  [["id", 59], ["LIMIT", 1]]
UPDATE "permissions" SET "access_type" = $1, "updated_at" = $2 WHERE "permissions"."id" = $3  [["access_type", 1], ["updated_at", "2024-10-17 21:30:14.154617"], ["id", 63]]
---
    def update
        permission = Permission.find(params[:id])

        # Check if the current user is the creator of the document associated with the permission
        document = Document.find(permission.document_id) # Get the document associated with the permission

        if document.created_by_id == current_user.id
          new_permission = { access_type: params[:permission] }

          if permission.update(new_permission)