back-end/app/controllers/requests_controller.rb

  def show
    requests = Request.where(user_id: current_user.id)
    if requests.any?
---
SELECT "requests".* FROM "requests" WHERE "requests"."user_id" = $1  [["user_id", 10]]
SELECT 1 AS one FROM "requests" WHERE "requests"."user_id" = $1 LIMIT $2  [["user_id", 10], ["LIMIT", 1]]

  def create
    # Ensure only creators can send requests
    document = Document.find_by(id: request_params[:document])
    return render json: { error: 'Document not found' }, status: :not_found unless document

    unless document.created_by_id == current_user.id
      return render json: { error: 'Only the creator can send requests.' }, status: :forbidden
    end

    user = User.find_by(email: request_params[:user])
    if user
      # Check if the request already exists
      existing_request = Request.find_by(document_id: document.id, user_id: user.id)
      if existing_request
        return render json: { error: 'A request has already been sent to this user for this document.' }, status: :unprocessable_entity
      end

      # Create the request with document_title
      request = Request.new(
        permission: request_params[:permission],
        user_id: user.id,
        document_id: document.id,
        document_title: document.title # Include document title here
      )

      if request.save
---
SELECT "documents".* FROM "documents" WHERE "documents"."id" = $1 LIMIT $2  [["id", 59], ["LIMIT", 1]]
INSERT INTO "requests" ("permission", "document_id", "user_id", "created_at", "updated_at", "document_title") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["permission", 2], ["document_id", 59], ["user_id", 10], ["created_at", "2024-10-17 21:19:45.780889"], ["updated_at", "2024-10-17 21:19:45.780889"], ["document_title", "First"]]
SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "nada@gmail.com"], ["LIMIT", 1]]
SELECT "requests".* FROM "requests" WHERE "requests"."document_id" = $1 AND "requests"."user_id" = $2 LIMIT $3  [["document_id", 59], ["user_id", 10], ["LIMIT", 1]]

  def destroy
    request = Request.find_by(id: params[:id], user_id: current_user.id)

    if request
      request.destroy
---
SELECT "requests".* FROM "requests" WHERE "requests"."id" = $1 AND "requests"."user_id" = $2 LIMIT $3  [["id", 63], ["user_id", 10], ["LIMIT", 1]]
DELETE FROM "requests" WHERE "requests"."id" = $1  [["id", 63]]